Revit 2026 API

# ColorFillSchemeIsByRange Property

---

Represents if the parameter values in entries are treated as value range or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsByRange { get; set; }
```
```vb
Public Property IsByRange As Boolean
	Get
	Set
```
```cpp
public:
property bool IsByRange {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsByRange : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: The scheme entries cannot be explained by range. |

Notes:

  * Only numeric parameter values could be treated as by range.
  * There will exist at least two entries if the scheme is by range, and the first entry value should be always Int.MinValue or -Double.MaxValue.
  * The entries will always be sorted by ascending in the scheme if it is by range.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace